{
    "currentDisputedAgenda": {
        "name": "Research Grant Reallocation",
        "type": "Directive",
        "elect": "Player",
        "description": "The elected player gains any 1 technology of their choice. Then, for each prerequisite on that technology, they remove 1 token from their fleet pool and return it to their reinforcements."
    },
    "activeAgendas": [],
    "agendaDeck": [
        {
            "name": "Conventions of War",
            "type": "Law",
            "elect": "",
            "for": "Players cannot use BOMBARDMENT against units that are on cultural planets.",
            "against": "Each player that voted \"Against\" discards all of their action cards."
        },
        {
            "name": "New Constitution",
            "type": "Directive",
            "elect": "",
            "for": "When this agenda is revealed, if there are no laws in play, discard this card and reveal another agenda from the top of the deck. Discard all laws in play. At the start of the next strategy phase, each player exhausts each planet in their home system.",
            "against": "No effect."
        },
        {
            "name": "Unconventional Measures",
            "type": "Directive",
            "elect": "",
            "for": "Each player that voted \"For\" draws 2 action cards.",
            "against": "Each player that voted \"For\" discards all of their action cards."
        },
        {
            "name": "Minister of Exploration",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card.\nWhen the owner of this card gains control of a planet, they gain 1 trade good."
        },
        {
            "name": "Miscount Disclosed",
            "type": "Directive",
            "elect": "Law",
            "description": "When this agenda is revealed, if there are no laws in play, discard this card and reveal another agenda from the top of the deck.\nVote on the elected law as if it were just revealed from the top of the deck."
        },
        {
            "name": "Homeland Defense Act",
            "type": "Law",
            "elect": "",
            "for": "Each player can have any number of PDS units on planets they control.",
            "against": "Each player destroys 1 of their PDS unit."
        },
        {
            "name": "Judicial Abolishment",
            "type": "Directive",
            "elect": "Law",
            "description": "When this agenda is revealed, if there are no laws in play, discard this card and reveal another agenda from the top of the deck.\nDiscard the elected law from play."
        },
        {
            "name": "Regulated Conscription",
            "type": "Law",
            "elect": "",
            "for": "When a player produces units, they produce only 1 fighter and infantry for its cost instead of 2.",
            "against": "No effect."
        },
        {
            "name": "Executive Sanctions",
            "type": "Law",
            "elect": "",
            "for": "Each player can have a maximum of 3 action cards in their hand.",
            "against": "Each player discards 1 random action card from their hand."
        },
        {
            "name": "Anti-Intellectual Revolution",
            "type": "Law",
            "elect": "",
            "for": "After a player researches a technology, they must destroy 1 of their non-fighter ships.",
            "against": "At the start of the next strategy phase, each player chooses and exhausts 1 planet for each technology they own."
        },
        {
            "name": "Compensated Disarmament",
            "type": "Directive",
            "elect": "Planet",
            "description": "Destroy each ground force on the elected planet; for each unit that was destroyed, the player who controls that planet gains 1 trade good."
        },
        {
            "name": "Search Warrant",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card and draws 2 secret objectives.\nThe owner of this card plays with their secret objectives revealed."
        },
        {
            "name": "Wormhole Reconstruction",
            "type": "Law",
            "elect": "",
            "for": "All systems that contain either an alpha or beta wormhole are adjacent to each other.",
            "against": "Each player places a command token from their reinforcements in each system that contains a wormhole and 1 or more of their ships."
        },
        {
            "name": "Enforced Travel Ban",
            "type": "Law",
            "elect": "Cultural Planet",
            "description": "FOR : Alpha and beta wormholes have no effect during movement.\nAGAINST : Destroy each PDS in or adjacent to a system that contains a wormhole."
        },
        {
            "name": "Ixthian Artifact",
            "type": "Directive",
            "elect": "",
            "for": "The speaker rolls 1 die. If the result is 6-10, each player may research 2 technologies. If the result is 1-5, destroy all units in Mecatol Rex's system, and each player with units in systems adjacent to Mecatol Rex's system destroys 3 of their units in each of those systems.",
            "against": "No effect."
        },
        {
            "name": "Nexus Sovereignty",
            "type": "Law",
            "elect": "",
            "for": "Alpha and beta wormholes in the wormhole nexus have no effect during movement.",
            "against": "Place a gamma wormhole token in the Mecatol Rex system."
        },
        {
            "name": "Shared Research",
            "type": "Law",
            "elect": "",
            "for": "Each player's units can move through nebulae.",
            "against": "Each player places a command token from their reinforcements in their home system, if able."
        },
        {
            "name": "Clandestine Operations",
            "type": "Directive",
            "elect": "",
            "for": "Each player removes 2 command tokens from their command sheet and returns those tokens to their reinforcements.",
            "against": "Each player removes 1 command token from their fleet pool and returns that token to their reinforcements."
        },
        {
            "name": "Political Censure",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card and 1 victory point.\nThe elected player cannot play action cards.\nIf the owner of this card loses this card, they lose 1 victory point."
        },
        {
            "name": "Covert Legislation",
            "type": "Directive",
            "elect": "",
            "description": "When this agenda is revealed, the speaker draws the next card in the agenda deck but does not reveal it to the other players. Instead, the speaker reads the eligible outcomes aloud (for, against, elect player, etc.); the other players vote for these outcomes as if they were outcomes of this agenda, without knowing their effects."
        },
        {
            "name": "Rearmament Agreement",
            "type": "Directive",
            "elect": "",
            "for": "Each player places 1 mech from their reinforcements on a planet they control in their home system.",
            "against": "Each player replaces each of their mechs with 1 infantry from their reinforcements."
        },
        {
            "name": "Checks and Balances",
            "type": "Law",
            "elect": "",
            "for": "When a player chooses a strategy card during the strategy phase, they give that strategy card to another player that does not have 1 (or a player that does not have 2 in a three- or four-player game), if able.",
            "against": "Each player readies only 3 of their planets at the end of this agenda phase."
        },
        {
            "name": "Prophecy of Ixth",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card.\nThe owner of this card applies +1 to the result of their fighter's combat rolls. When the owner of this card uses PRODUCTION, they discard this card unless they produce 2 or more fighters."
        },
        {
            "name": "Mutiny",
            "type": "Directive",
            "elect": "",
            "for": "Each player who voted \"For\" gains 1 victory point.",
            "against": "Each player who voted \"For\" loses 1 victory point."
        },
        {
            "name": "Articles of War",
            "type": "Law",
            "elect": "",
            "for": "All mechs lose their printed abilities except for SUSTAIN DAMAGE.",
            "against": "Each player that voted \"For\" gains 3 trade goods."
        },
        {
            "name": "Minister of Commerce",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card.\nAfter the owner of this card replenishes commodities, they gain 1 trade good for each player that is their neighbor."
        },
        {
            "name": "Fleet Regulations",
            "type": "Law",
            "elect": "",
            "for": "Each player cannot have more than 4 tokens in their fleet pool.",
            "against": "Each player places 1 command token from their reinforcements in their fleet pool."
        },
        {
            "name": "Incentive Program",
            "type": "Directive",
            "elect": "",
            "for": "Draw and reveal 1 stage I public objective from the deck and place it near the public objectives.",
            "against": "Draw and reveal 1 stage II public objective from the deck and place it near the public objectives."
        },
        {
            "name": "Seed of an Empire",
            "type": "Directive",
            "elect": "",
            "for": "The player with most victory points gains 1 victory point.",
            "against": "The player with the fewest victory points gains 1 victory point."
        },
        {
            "name": "Representative Government",
            "type": "Law",
            "elect": "",
            "for": "Players cannot exhaust planets to cast votes during the agenda phase; each player may cast 1 vote on each agenda instead. Players cannot cast additional votes.",
            "against": "At the start of the next strategy phase, each player that voted \"Against\" exhausts all of their cultural planets."
        },
        {
            "name": "Committee Formation",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card. Before players vote on an agenda that requires a player to be elected, the owner of this card may discard this card to choose a player to be elected. Players do not vote on that agenda."
        },
        {
            "name": "Archived Secret",
            "type": "Directive",
            "elect": "Player",
            "description": "Elected player draws 1 secret objective."
        },
        {
            "name": "Wormhole Research",
            "type": "Directive",
            "elect": "",
            "for": "Each player who has 1 or more ships in a system that contains a wormhole may research 1 technology. Then, destroy all ships in systems that contain an alpha or beta wormhole.",
            "against": "Each player that voted \"Against\" removes 1 command token from their command sheet and returns it to their reinforcements."
        },
        {
            "name": "Armed Forces Standardization",
            "type": "Directive",
            "elect": "Player",
            "description": "The elected player places command tokens from their reinforcements so that they have 3 tokens in their tactic pool, 3 tokens in their fleet pool and 2 tokens in their strategy pool. They return any excess tokens to their reinforcements."
        },
        {
            "name": "Minister of War",
            "type": "Law",
            "elect": "Player",
            "description": "The elected player gains this card.\nThe owner of this card may discard this card after performing an action to remove 1 of their command counters from the game board and return it to their reinforcements; then they may perform 1 additional action."
        },
        {
            "name": "Classified Document Leaks",
            "type": "Law",
            "elect": "Scored Secret Objective",
            "description": "When this agenda is revealed, if there are no scored secret objectives, discard this card and reveal another agenda from the top of the deck. The elected secret objective becomes a public objective; place it near the other public objectives in the common play area."
        },
        {
            "name": "Galactic Crisis Pact",
            "type": "Directive",
            "elect": "Strategy Card",
            "description": "Each player may perform the secondary ability of the elected strategy card without spending a command token; command tokens placed by the ability are placed from a player's reinforcements instead."
        },
        {
            "name": "Publicize Weapon Schematics",
            "type": "Law",
            "elect": "",
            "for": "If any player owns a war sun technology, all players may ignore all prerequisites on war sun technologies. All war suns lose SUSTAIN DAMAGE.",
            "against": "Each player that owns a war sun technology discards all of their action cards."
        },
        {
            "name": "Arms Reduction",
            "type": "Directive",
            "elect": "",
            "for": "Each player destroys all but 2 of their dreadnaughts and all but 4 of their cruisers.",
            "against": "At the start of the next strategy phase, each player exhausts each of their planets that have a technology specialty."
        },
        {
            "name": "Public Execution",
            "type": "Directive",
            "elect": "Player",
            "description": "The elected player discards all of their action cards. If they have the speaker token, they give it to the player on their left. The elected player cannot vote on any agendas during this agenda phase."
        },
        {
            "name": "Swords to Plowshares",
            "type": "Directive",
            "elect": "",
            "for": "Each player destroys half of their infantry on each planet they control, rounded up. Then, each player gains trade goods equal to the number of their infantry that were destroyed.",
            "against": "Each player places 1 infantry from their reinforcements on each planet they control."
        }
    ]
}